Revit 2027 API
PipingSystemType.FlowConversionMethod Property
 The flow conversion method for the piping system type.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FlowConversionMode FlowConversionMethod { get; set; }
Public Property FlowConversionMethod As FlowConversionMode
	Get
	Set
public:
property FlowConversionMode FlowConversionMethod {
	FlowConversionMode get ();
	void set (FlowConversionMode value);
}
member FlowConversionMethod : FlowConversionMode with get, set
Property Value
FlowConversionMode
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace